-- /*==================================================================================================================          
-- CRIAÇÃO: JULIANO
-- DATA: 2025-03-07
-- DESCRIÇÃO: TABELA DIMENSAO DE SEASON
-- ==================================================================================================================*/
-- /*==================================================================================================================          
-- INDICE
-- ST = STRING (TEXTO)
-- NM = NUMBER (FLOAT, INT , ETC..)
-- DT = DATE
-- ID = NUMBER (CHAVE UNICA DE RELACIONAMENTO)
-- ==================================================================================================================*/
-- /*==================================================================================================================
ALTER VIEW vw_dim_season AS(
SELECT
    G.game_id
    ,G.season_id
    ,G.season_type
    ,GS.season AS seasson_year
FROM game G
LEFT JOIN game_info GI
    ON G.game_id = GI.game_id
LEFT JOIN game_summary GS
    ON G.game_id = GS.game_id
)
